app/views/orders/index.html.erb

INSERT INTO `orders` (`user_id`, `created_at`, `updated_at`, `total`) VALUES (2, '2019-10-09 14:11:20', '2019-10-09 14:11:20', 300.0)
---
        <%order.total = order_total%>
        <%order.save%>