app/views/orders/index.html.erb

SELECT `products`.* FROM `products`
---
  		<%if order.user_id == current_user.id %>
		 	  <% order.products.each do |product| %>