app/views/orders/index.html.erb

		<% @products.each do |product_o|%>
			<% product_o.orders.each do |order|   %>
---
SELECT `orders`.* FROM `orders` INNER JOIN `orders_products` ON `orders`.`id` = `orders_products`.`order_id` WHERE `orders_products`.`product_id` = 1