app/views/carts/index.html.erb

      <%if cart.user_id == current_user.id %>
        <% cart.products.each do |product|%>
---
SELECT `products`.* FROM `products`