app/views/carts/index.html.erb

    <% @products.each do |product_c|%>
      <% product_c.carts.each do |cart|   %>
---
SELECT `carts`.* FROM `carts` INNER JOIN `carts_products` ON `carts`.`id` = `carts_products`.`cart_id` WHERE `carts_products`.`product_id` = 1