app/controllers/carts_controller.rb

SELECT `carts`.* FROM `carts`
SELECT `products`.* FROM `products`
---
	def index
		@carts = Cart.all
		@products = Product.all

INSERT INTO `carts` (`user_id`, `created_at`, `updated_at`, `quantity`) VALUES (2, '2019-10-14 04:31:05', '2019-10-14 04:31:05', 1)
---
	def create
		@cart = Cart.new(cart_params)
		@cart.user_id = current_user.id
		begin
			@cart.save

DELETE FROM `carts` WHERE `carts`.`id` = 8
---
	def destroy
		@cart.destroy

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 4 LIMIT 1
---
	def add
	  @product = Product.find(params[:product_id])