app/controllers/orders_controller.rb

	def index
		@orders = current_user.orders.includes(:products)
---
SELECT `orders`.* FROM `orders` INNER JOIN `orders_products` ON `orders`.`id` = `orders_products`.`order_id` WHERE `orders_products`.`product_id` = 1
SELECT  `products`.* FROM `products` ORDER BY `products`.`id` ASC LIMIT 1

	def create
		if current_user.orders.first.nil?
			@order = Order.new(order_params)
			@order.user_id = current_user.id
			@order.save
---
SELECT  `orders`.* FROM `orders` LIMIT 11
INSERT INTO `orders` (`user_id`, `created_at`, `updated_at`) VALUES (2, '2019-10-11 14:21:18', '2019-10-11 14:21:18')

	def destroy
		begin
   	  current_user.orders.first.destroy
---
DELETE FROM `orders` WHERE `orders`.`id` = 33

	def get_order
		begin
   	  @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 73 LIMIT 1

	def add_to_orders_products
		begin
		current_user.orders.reload
		current_user.cart.products.each do |cart_product|
			cart_product.orders << current_user.orders.first	if !cart_product.nil?
			if cart_product.orders
					#change qnt_type in quantities table from 'Cart' to 'Order'
					@quantity = cart_product.quantities.where(qnt_id: current_user.cart.id).first
	 				@quantity.qnt_type.sub!(/Cart/, 'Order')
	 				@quantity.qnt_id = current_user.orders.first.id
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 4 LIMIT 1