app/controllers/orders_controller.rb

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 33 LIMIT 1
---
	def set_order
		begin
   	  @order = Order.find(params[:id])