app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `price`, `brand`, `description`, `offer`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES ('T-shirt', 30.0, 'Addidas', 'Half-sleeve Full-Nack', '65% off', '2019-10-09 11:21:42', '2019-10-09 11:21:42', 'download.jpeg', 'image/jpeg', 10854, '2019-10-09 11:21:42')

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `image_file_name` = '125-fall-in-love.png', `image_content_type` = 'image/png', `image_file_size` = 5539, `image_updated_at` = '2019-10-09 11:41:26', `updated_at` = '2019-10-09 11:41:26' WHERE `products`.`id` = 2