app/controllers/wishlists_controller.rb

SELECT `wishlists`.* FROM `wishlists`
SELECT `products`.* FROM `products`
---
	def index
		@wishlists = Wishlist.all
		@products = Product.all

INSERT INTO `wishlists` (`user_id`, `created_at`, `updated_at`) VALUES (2, '2019-10-11 05:43:41', '2019-10-11 05:43:41')
---
	def create
		@wishlist = Wishlist.new
		@wishlist.user_id = current_user.id
		begin
			@wishlist.save

DELETE FROM `wishlists` WHERE `wishlists`.`id` = 1
---
	def destroy
		@wishlist.destroy

SELECT  `wishlists`.* FROM `wishlists` WHERE `wishlists`.`id` = 1 LIMIT 1
---
	def set_wishlist
     	@wishlist = Wishlist.find(params[:id])

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 6 LIMIT 1
INSERT INTO `wishlists` (`user_id`, `created_at`, `updated_at`) VALUES (2, '2019-10-10 04:20:57', '2019-10-10 04:20:57')
---
    def add
	  @product = Product.find(params[:product_id])
	  @product.wishlists << @wishlist