app/models/order.rb

   def order_total
   	@products = Product.all
   	@carts = Cart.all
   	@orders = Order.all
    	@products.each do |product|
  	 	  product.orders.each do |order|
  			  @orders.each do |order_main|
---
SELECT `products`.* FROM `products`
SELECT `orders`.* FROM `orders` INNER JOIN `orders_products` ON `orders`.`id` = `orders_products`.`order_id` WHERE `orders_products`.`product_id` = 1
SELECT `orders`.* FROM `orders`

		def get_quantity
		 	@products = Product.all
	   	@carts = Cart.all
	   	@orders = Order.all
	   	@get_quantity = []
		  				 	@products.each do |product|
		  				 		product.carts.each do |cart|
		  				 			@carts.each do |cart_main|
---
SELECT `products`.* FROM `products`
SELECT `carts`.* FROM `carts` INNER JOIN `carts_products` ON `carts`.`id` = `carts_products`.`cart_id` WHERE `carts_products`.`product_id` = 1
SELECT `carts`.* FROM `carts`