app/views/wishlists/index.html.erb

 		<%if !current_user.wishlist.nil?%>
			<% current_user.wishlist.products.each do |product| %>
---
SELECT `products`.* FROM `products`
SELECT `wishlists`.* FROM `wishlists` INNER JOIN `products_wishlists` ON `wishlists`.`id` = `products_wishlists`.`wishlist_id` WHERE `products_wishlists`.`product_id` = 1